---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarBarDeformationType
source: html/5861b04f-9eca-9de9-647b-1b1281232459.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarBarDeformationType Property

"Deformation"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarBarDeformationType { get; }
```